Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/children_and_young_offenders/community_sanctions.html.txt.tmx
Source language: en
Languages: ga

source: Detention of a child who is convicted of a crime is considered a last resort
ga: Is é an rogha deiridh leanbh atá ciontaithe i gcoir a choinneáil faoi choimeád

source: As an alternative to detention, the Children Act 2001 provides for a range of community sanctions that can be imposed by a court
ga: Déanann Acht na Leanaí 2001 foráil i gcomhair réimse smachtbhannaí pobail gur féidir le cúirt a chur i bhfeidhm mar rogha eile ar choinneáil

source: The court must consider that a community sanction is the most suitable way of dealing with the case
ga: Ní mór don chúirt a mheas gur smachtbhanna pobail an bealach is feiliúnaí chun an cás a láimhseáil

source: These sanctions allow a child to remain in the community and stay at school
ga: Ligeann na smachtbhannaí seo do leanbh fanacht sa phobal agus fanacht ar scoil

source: The Young Persons Probation division of the Probation Service oversees the implementation of most of the community sanctions
ga: Déanann rannóg Phromhadh na nDaoine Óga den tSeirbhís Promhaidh maoirsiú ar chur i bhfeidhm fhormhór na smachtbhannaí pobail

source: If a child does not comply with a community sanction that has been imposed the case is returned to the court
ga: Mura gcloíonn leanbh le smachtanna pobail a chuirtear i bhfeidhm, tugtar an cás ar ais os comhair na cúirte

source: Apart from a community service order, all community sanction orders expire 6 months after the child has reached 18 years of age, if they have not already done so
ga: Téann gach ordú smachtbhanna pobail, seachas ordú seirbhíse pobail, in éag 6 mhí tar éis don leanbh 18 bliana d’aois a shroichint, mura bhfuil siad imithe in éag cheana féin

source: There are 10 community sanctions available to the courts
ga: Tá 10 smachtbhanna pobail ar fáil do na cúirteanna

source: Under a community service order a child aged 16 or 17 completes a set number of hours of unpaid work
ga: Faoi ordú seirbhíse pobail, déanann leanbh atá 16 nó 17 mbliana d’aois méid áirithe uaireanta oibre nach bhfaigheann siad íocaíocht orthu

source: The number of hours can range from 40 – 240 hours
ga: Is féidir líon uaireanta idir 40 - 240 a bheith i gceist anseo

source: A day centre order requires a child to attend a day centre and participate in a programme of activities
ga: Ceanglaíonn ordú ionaid lae ar leanbh freastal ar ionad lae agus páirt a ghlacadh i gclár imeachtaí

source: Attendance at the centre is for a maximum of 90 days
ga: Bíonn uasthréimhse de 90 lá i gceist le freastal ar an ionad

source: The days need not be consecutive, but attendance cannot exceed a period of 6 months
ga: Ní gá do na laethanta a bheith comhleantach, ach ní féidir le freastal dul thar thréimhse 6 mhí

source: Generally, the programme is available in the evenings and on weekends so as not to interfere with school, training or employment
ga: Is iondúil go mbíonn an clár ar siúl sa tráthnóna agus ar dheirí seachtaine ionas nach gcuirfidh sé isteach ar an scoil, ar oiliúint ná ar fhostaíocht

source: A probation order places a child under the supervision of the Probation Service for a period of time
ga: Cuireann ordú promhaidh leanbh faoi mhaoirsiú na Seirbhíse Promhaidh ar feadh tréimhse ama

source: During the period the child must meet certain conditions that are set by the court
ga: I rith na tréimhse sin, ní mór don leanbh coinníollacha áirithe atá leagtha síos ag an gcúirt a chomhlíonadh

source: • To be of good behaviour
ga: • Iad féin a iompar go maith

source: • To follow the instructions of the supervising probation officer
ga: • Treoracha an oifigigh promhaidh atá á maoirsiú a leanúint

source: Additional conditions may include paticipation in a training course or activity and residence in a hostel
ga: D’fhéadfadh rannpháirtíocht i gcúrsa oiliúna nó i ngníomhaíocht agus cónaí i mbrú a bheith i measc na gcoinníollacha eile

source: Training or activities programme order
ga: Ordú cláir oiliúna nó gníomhaíochtaí

source: This is a type of probation order where the child has to complete a programme of training or activity recommended by a probation officer
ga: Is cineál ordú promhaidh é seo inar gá don leanbh clár oiliúna nó gníomhaíocht a mholann oifigeach promhaidh a chomhlíonadh

source: The programme may be managed by the Probation Service or some other body
ga: D’fhéadfadh an clár seo a bheith á bhainistiú ag an tSeirbhís Promhaidh nó ag comhlacht éigin eile

source: It does not necessarily cater exclusively for children found guilty of offences
ga: Ní gá gur ar leanaí a fuarthas ciontach i gcionta amháin a fhreastalaíonn sé

source: Under an intensive supervision order a child is placed under the close supervision of a probation officer
ga: Faoi ordú dian-mhaoirsithe, cuirtear leanbh faoi dhian-mhaoirsiú ag oifigeach promhaidh

source: During the period of the order the child is required to live at a specified residence and attend a programme of education, training or treatment
ga: I rith tréimhse an ordaithe, ní mór don leanbh maireachtáil in áitreabh ar leith agus freastal ar chlár oideachais, oiliúna nó cóireála

source: The order cannot exceed 180 days
ga: Ní féidir leis an ordú seo dul thar 180 lá

source: If the order is over 90 days it is subject to review after 60 days
ga: Má tá an t-ordú os cionn 90 lá, tá sé faoi réir athbhreithnithe tar éis 60 lá

source: A court can order that a child lives in a hostel
ga: Is féidir leis an gcúirt ordú go mairfidh leanbh i mbrú

source: The hostel would be reasonably close to where the child usually lives or to where they go to school, work or attend training
ga: Bheadh an brú réasúnta gar don áit ina mbíonn cónaí ar an leanbh go hiondúil, nó don áit a dtéann sé/sí ar scoil, ag obair nó i mbun oiliúna

source: The period of the order cannot exceed one year
ga: Ní féidir le tréimhse an ordaithe dul thar bhliain amháin

source: Suitable person (care and supervision) order
ga: Ordú dhuine feiliúnach (cúram agus maoirsiú)

source: Under a suitable person order the court places a child into the care of a suitable adult
ga: Faoi ordú dhuine feiliúnach, cuireann an chúirt leanbh i gcúram duine fásta feiliúnach

source: The suitable person can be a relative
ga: Is féidir gaol a ainmniú mar dhuine feiliúnach

source: The child’s parents must give their consent in writing
ga: Ní mór do thuismitheoirí an linbh a dtoiliú a thabhairt i scríbhinn

source: The period of the order cannot exceed 2 years
ga: Ní féidir le tréimhse an ordaithe dul thar 2 bhliain

source: Mentor (family support) order
ga: Ordú Meantóra (tacaíocht don teaghlach)

source: A court can assign someone, a mentor, to help, advise and support the child and the child’s family in the family’s efforts to try and stop the child from committing further offences
ga: Is féidir le cúirt duine éigin, meantóir a shannadh chun cabhrú leis na leanbh agus le teaghlach an linbh, chun comhairle a chur orthu agus chun tacú leo ina n-iarrachtaí chun an leanbh a stopadh ó chionta eile a dhéanamh

source: The mentor also monitors the child’s behaviour generally
ga: Déanann an meantóir monatóireacht ar iompar an linbh go ginearálta freisin

source: The child and the parents must give their consent and the period of the order cannot not exceed 2 years
ga: Ní mór don leanbh agus dá t(h)uismitheoirí a dtoiliú a thabhairt agus ní féidir le tréimhse an ordaithe dul thar 2 bhliain

source: A restriction on movement order is a curfew order supervised by the Gardaí
ga: Is éard atá in ordú sriain ar ghluaiseacht ná ordú cuirfiú atá á mhaoirsiú ag na Gardaí

source: The child is required to be at a certain address between 7pm and 6am
ga: Ní mór don leanbh a bheith ag seoladh áirithe idir 7in agus 6rn

source: The maximum period of time the curfew can be imposed for is 6 months
ga: Is é an tréimhse is faide dár féidir an cuirfiú a chur i bhfeidhm ná 6 mhí

source: Instead of the curfew or as well as the curfew, the order can include a condition to stay away from a specified area
ga: In áit an chuirfiú nó in éineacht leis an gcuirfiú, is féidir coinníoll a bheith san áireamh san ordú fanacht amach ó cheantar ar leith

source: The maximum period of time for this condition is 12 months
ga: Is í an tréimhse ama is faide dár féidir an coinníoll seo a chur i bhfeidhm ná 12 mhí

source: A dual order combines a restriction of movement order with either a day centre order or a probation order
ga: Bíonn ordú srianta ar ghluaiseacht in éineacht le hordú ionaid lae nó ordú promhaidh i gceist in ordú dúbailte

source: The child’s movements are restricted for a maximum of 6 months
ga: Bíonn srian ar ghluaiseachtaí an linbh ar feadh tréimhse nach faide ná 6 mhí

source: At the same time, the child attends a day centre for a maximum of 90 days or is under the supervision of a probation officer
ga: Ag an am céanna, freastalaíonn an leanbh ar ionad lae ar feadh 90 lá ar a mhéid, nó bíonn sé/sí faoi mhaoirsiú oifigigh promhaidh
